# core
brew "coreutils"
brew "curl"
brew "git"
brew "wget"

# shell
brew "zsh"
brew "tmux"
brew "fzf"
brew "starship"
brew "zoxide"
brew "atuin"

# zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# tmux plugins
brew "tpm"

# dotfiles
brew "stow"

# langs and runtimes
brew "fnm"            
brew "go"
brew "rustup"
brew "pyenv"         

# dev tools
brew "neovim"
brew "lazygit"
brew "gh"
brew "delta"         

# cli util
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "jq"
brew "btop"

# gnu / unix utilities
brew "gnu-sed"
brew "gnu-tar"

# sdks / runtimes
cask "dotnet-sdk"     
cask "temurin"
cask "basictex"

# dev
cask "github"

# terminal emulator
cask "ghostty"

# fonts
cask "font-jetbrains-mono-nerd-font"

# apps 
cask "firefox"
cask "pearcleaner"
cask "spotify"
