# ------------------------------------------------------------
# core cli tools
# ------------------------------------------------------------

brew "coreutils"
brew "curl"
brew "git"
brew "tree"
brew "watchman"

# ------------------------------------------------------------
# terminal / shell environment
# ------------------------------------------------------------

brew "zsh"
brew "tmux"
brew "fzf"
brew "starship"
brew "zoxide"
brew "atuin"

# ------------------------------------------------------------
# programming languages & runtimes
# ------------------------------------------------------------

brew "node"
brew "python@3.14"
brew "rustup"
brew "dotnet", link: false

# ------------------------------------------------------------
# development tools
# ------------------------------------------------------------

brew "neovim"
brew "lazygit"
brew "gh"

# ------------------------------------------------------------
# cli utilities
# ------------------------------------------------------------

brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"

# ------------------------------------------------------------
# gnu / unix utilities
# ------------------------------------------------------------

brew "gnu-sed"
brew "gnu-tar"

# ------------------------------------------------------------
# development environments / ides
# ------------------------------------------------------------

cask "visual-studio-code"
cask "pycharm"
cask "rider"
cask "rustrover"

# ------------------------------------------------------------
# sdks / runtimes
# ------------------------------------------------------------

cask "dotnet-sdk"
cask "temurin"

# ------------------------------------------------------------
# development software
# ------------------------------------------------------------

cask "github"

# ------------------------------------------------------------
# terminal
# ------------------------------------------------------------

cask "ghostty"

# ------------------------------------------------------------
# web / browsing
# ------------------------------------------------------------

cask "google-chrome"
cask "firefox"

# ------------------------------------------------------------
# productivity
# ------------------------------------------------------------

cask "obsidian"
cask "pearcleaner"

# ------------------------------------------------------------
# media
# ------------------------------------------------------------

cask "spotify"
cask "vlc"

# ------------------------------------------------------------
# virtualization
# ------------------------------------------------------------

cask "utm"